.config/emacs/emacs.org
#+TITLE: Emacs Configuration
#+AUTHOR: Daniel Hwang
#+DESCRIPTION: Personal Emacs configuration
#+STARTUP: overview
* Early Init
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/early-init.el :mkdrip yes
;; early-init.el --- Emacs pre package.el & GUI configuration -*- lexical-binding: t; -*-
;; Code:

;; Unneeded UI elemenets
(menu-bar-mode -1)
(tool-bar-mode -1)      
(scroll-bar-mode -1)    
(tooltip-mode -1)       
(set-fringe-mode 10)

(setopt backup-inhibited t
  	    make-backup-files nil
  	    auto-save-default nil
        native-comp-async-report-warnings-errors nil
        inhibit-splash-screen t
        use-file-dialog nil
        ;; Set custom custom.el
        custom-file "~/.dotfiles/.config/emacs/custom.el"
        ;; Follow symlinks (for git dotfiles)
        vc-follow-symlinks t)
        
  #+end_src
* Init
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
;; -*- lexical-binding: t; -*-
#+end_src
* Emacs
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package emacs
  :ensure nil
  :init
  ;; Frame height and width
  (add-to-list 'default-frame-alist '(height . 24))
  (add-to-list 'default-frame-alist '(width . 80))
  ;; Set tab width
  (setq-default tab-width 2)
  (setq-default indent-tabs-mode nil)
  ;; Do not create lock files
  (setq-default create-lockfiles nil)
  :bind
  ("M-o" . other-window)
  ("C-x k" . 'kill-cur-buffer)
  ("C-c '" . org-edit-src-code)
  ("C-c c e" . 'config-edit)
  :hook
  ;; Enable line numbers for some modes
  ((prog-mode . display-line-numbers-mode)
   (conf-mode . display-line-numbers-mode))

  :config
  (set-face-attribute 'default nil
                      :family "Agave"
                      :height 160)
  (set-face-attribute 'fixed-pitch nil
                      :family "Agave"
                      :height 160
                      )
  (set-face-attribute 'variable-pitch nil
                      :family "Atkinson Hyperlegible Next"
                      :height 160)

  (setopt scroll-conservatively 100)
  (setopt scroll-margin 4)

  (setopt org-src-window-setup 'current-window)

  (defun kill-cur-buffer ()
    (interactive)
    (kill-buffer (current-buffer)))

  (defun config-edit ()
    (interactive)
    (find-file "~/.dotfiles/.config/emacs/emacs.org"))
  (defalias 'yes-or-no-p 'y-or-n-p)

  :custom
  (tab-always-indent 'complete)
  (read-extended-command-predicate #'command-completion-default-include-p)
  (use-short-answers t)
  )
#+end_src
* Modeline
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(setq-default mode-line-format
  '("%e"
     " %o "
     "%* "
     my-modeline-buffer-name
     my-modeline-major-mode))

(defvar-local my-modeline-buffer-name
  '(:eval
     (when (mode-line-window-selected-p)
       (propertize (format " %s " (buffer-name)))))
  "Mode line construct to display the buffer name.")

(put 'my-modeline-buffer-name 'risky-local-variable t)

(defvar-local my-modeline-major-mode
  '(:eval
     (list
       (propertize "λ" 'face 'shadow)
       " "
       (propertize (capitalize (symbol-name major-mode)) 'face 'bold)))
  "Mode line construct to display the major mode.")

(put 'my-modeline-major-mode 'risky-local-variable t)
#+end_src

* Ibuffer
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package ibuffer
  :ensure nil
  :bind
  ("C-x C-b" . ibuffer)
  :custom
  (ibuffer-use-other-window t)
 )
#+end_src

* isearch
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package isearch
  :ensure nil
  :bind
  :custom
	isearch-lax-whitespace t
	isearch-lazy-count t
	isearch-repeat-on-direction-change t
	isearch-wrap-pause 'no-ding
	lazy-count-prefix-format "[%s of %s] => "
	search-whitespace-regexp ".*?"
  )
#+end_src


* Diminish
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package diminish)
#+end_src

* which-key
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package which-key
  :diminish which-key-mode
  :hook (after-init . which-key-mode)
  :config
  (setopt which-key-idle-delay 0.3)
  ) 
#+end_src

* Modules
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
;; Add configuration modules to load path
(add-to-list 'load-path '"~/.dotfiles/.config/emacs/modules")

;; Required Modules
(require 'el-package)
(require 'el-completion)
(require 'el-theme)
(require 'el-org)
(require 'el-ui)
(require 'el-dired)
(require 'el-eglot)
(require 'el-treesit)
(require 'el-flycheck)
(require 'el-magit)
(require 'el-denote)
(require 'modes)
#+end_src

* use-package
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-package.el :mkdirp yes
;; -*- lexical-binding: t; -*-
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-and-compile
  (setq use-package-always-ensure t
  	      use-package-expand-minimally t))

(provide 'el-package)
#+end_src

* flycheck
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-flycheck.el
(use-package flycheck
  :init (global-flycheck-mode)
  )

(use-package flycheck-eglot
  :after (flycheck eglot)
  :hook
  (prog-mode . flycheck-eglot-mode)
  )

(provide 'el-flycheck)
#+end_src

* completion
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
;; -*- lexical-binding: t; -*-
#+end_src
** Savehist
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package savehist
  :ensure nil
  :hook (after-init . savehist-mode)
  )
#+end_src
** Consult
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package consult
  :bind
  ("C-x b" . consult-buffer)
  :hook
  (completion-list-mode . consult-preview-at-point-mode)
  )
#+end_src

** Marginalia
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package marginalia
  :hook (after-init . marginalia-mode)
  )
#+end_src

** Orderless
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package orderless
  :config
  (setopt completion-styles '(orderless basic)
	        completion-category-defaults nil
	        completion-category-overrides '((file (styles partial-completion)))
	        )
  )
#+end_src

** Vertico
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package vertico
  :hook (after-init . vertico-mode)
  )
  #+end_src
  
** Corfu
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package corfu
  :hook
  (prog-mode . corfu-mode)
  (prog-mode . corfu-popupinfo-mode)
  :bind (:map corfu-map ("<tab>" . corfu-complete))
  :config
  (setopt tab-always-indent 'complete)
  (setopt corfu-preview-current nil)
  (setopt corfu-min-width 20)

  (setopt corfu-popupinto-delay '(1.25 . 0.5))
  
  (setq corfu-auto t
        corfu-auto-delay 0.2
        corfu-auto-trigger "."
        corfu-quit-no-match 'separator)
  
  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history))
  )
#+end_src

#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(provide 'el-completion)
#+end_src

* theme
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-theme.el
;; -*- lexical-binding: t; -*-

(use-package doric-themes
  :demand t
  :config
  (setq doric-themes-to-toggle '(doric-marble doric-obsidian))
  (setq doric-themes-to-rotate doric-themes-collection)
  
  (doric-themes-select 'doric-obsidian)
  
  :bind
  (("<f5>" . doric-themes-toggle)
   ("C-<f5>" . doric-themes-select)
   ("M-<f5>" . doric-themes-rotate))
  )

(provide 'el-theme)
#+end_src

* dired
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-dired.el
;; -*- lexical-binding: t; -*-
(use-package dired
  :ensure nil
  :commands (dired)
  :hook
  (dired-mode . dired-hide-details-mode)
  (dired-mode . hl-line-mode)
  :config
  (setopt dired-recursive-copies 'always
          dired-recursive-deletes 'always
          delete-by-moving-to-trash t
          dired-dwim-target t
          dired-kill-when-opening-new-dired-buffer t
          )
  )

(provide 'el-dired)
#+end_src

* eglot
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-eglot.el
;; -*- lexical-binding: t; -*-
(use-package eglot
  :ensure nil
  :bind (:map eglot-mode-map
        ("C-c l a" . eglot-code-actions)
	      ("C-c l r" . eglot-rename)
	      ("C-c l h" . eldoc)
	      ("C-c l f" . eglot-format)
	      ("C-c l F" . eglot-format-buffer)
	      ("C-c l d" . xref-find-definitions-at-mouse)
	      ("C-c l R" . eglot-reconnect))
  :hook
  ((html-mode html-ts-code) . eglot-ensure)
  ((css-ts-mode css-mode) . eglot-ensure)
  ((go-mode go-ts-mode) . eglot-ensure)
  ((python-mode python-ts-mode) . eglot-ensure)
  (org-mode . eglot-ensure)
  :config
  (setq-default eglot-workspace-configuration
                '(:harper-ls (:linters (:SpellCheck t
                                                    :SentenceCapitalization :json-false
                                                    :LongSentences :json-false
                                                    :Spaces :json-false))))
  (add-to-list 'eglot-server-programs
               '(org-mode . ("harper-ls" "--stdio"))
               )
  :custom
  (eglot-autoshutdown t)
  )
(provide 'el-eglot)
#+end_src

* org
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-org.el
;; -*- lexical-binding: t; -*-

(use-package org
  :ensure nil
  :init
  ;; org settings
  (setopt org-ellipsis " "
          org-src-fontify-natively t
          org-src-tab-acts-natively t
          org-confirm-babel-evaluate nil
          org-export-with-smart-quotes t
          org-src-window-setup 'current-window
          org-log-into-drawer t
          org-hide-emphasis-markers t
   )
  :hook
  (org-mode . org-indent-mode)
  (org-mode . visual-line-mode)
  :config
  ;; org-agenda
  (setopt org-agenda-start-with-log-macode nil)
  (setopt org-log-done 'time)
  ;; indentation
  (setopt org-edit-src-content-indentation 0
	        org-src-tab-acts-natively t
	        org-src-preserve-indentation t)
  ;; org-babel
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     )
   )
  )

(use-package org-faces
  :ensure nil
  :after org
  :config
  ;; Resize Org headings
  (dolist (face '((org-level-1 . 1.4)
                  (org-level-2 . 1.3)
                  (org-level-3 . 1.2)
                  (org-level-4 . 1.1)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Atkinson Hyperlegible Next" :weight 'bold :height (cdr face)))
  )

(use-package org-tempo
  :ensure nil
  :after org
  :config
  (dolist (item '(("s" . "src")
                  ("el" . "src emacs-lisp")
                  ("p" . "src python")
                  ("g" . "src go")
                  )
                )
    (add-to-list 'org-structure-template-alist item))
  )

(provide 'el-org)
#+end_src

* rainbow-delimiters
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-ui.el
;; -*- lexical-binding: t; -*-
(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode)
  )

(provide 'el-ui)
#+end_src

* treesit
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-treesit.el
(use-package treesit
  :ensure nil
  :init
  (setopt treesit-language-source-alist
        '(
          (bash "https://github.com/tree-sitter/tree-sitter-bash")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go") 
          (gomod "https://github.com/camdencheek/tree-sitter-go-mod")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (php "https://github.com/tree-sitter/tree-sitter-php" "master" "php/src")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")
          )
        )
  )

(use-package treesit-auto
  :ensure t
  :hook (prog-mode . treesit-auto-mode)
  )

(provide 'el-treesit)
#+end_src

* magit
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-magit.el
(use-package transient
  :init
  (message "Loading transient")
  )

(use-package magit
  :init
  (message "Loading Magit!")
  :config
  (message "Loaded Magit!")
  :bind (("C-x g" . magit-status)
         ("C-x C-g" . magit-status))
  )

(provide 'el-magit)
#+end_src

* envrc
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/modes.el
(use-package envrc
  :hook
  (after-init . envrc-global-mode)
)
#+end_src

* go-mode
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/modes.el
(defun go-run-this-file ()
  "go run"
  (interactive)
  (compile (format "go run %s" (buffer-file-name))))

(defun go-compile ()
  "go compile"
  (interactive)
  (compile "go build -v && go test -v && go vet"))

(defun go-compile-debug ()
  "go compile with necessary flags to debug with gdb"
  (interactive)
  (compile "go build -gcflags=all=\" -N -l\""))

(use-package go-mode
  :ensure t
  :bind (:map go-mode-map
         ("C-c C-k" . go-run-this-file)
         ("C-c C-c" . go-compile)
         ("C-c C-d" . go-compile-debug))
  :hook ((before-save . eglot-format-buffer))
)

(provide 'modes)
#+end_src

* denote
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-denote.el
;; -*- lexical-binding: t; -*-

(use-package denote
  :ensure t
  :hook (dired-mode . denote-dired-mode)
  :bind
  (("C-c n n" . denote)
   ("C-c n r" . denote-rename-file)
   ("C-c n l" . denote-link)
   ("C-c n b" . denote-backlinks)
   ("C-c n d" . denote-dired)
   ("C-c n g" . denote-grep))
  :config
  (setq denote-directory (expand-file-name "~/Documents/notes/"))

  ;; Automatically rename Denote buffers when opening them so that
  ;; instead of their long file name they have, for example, a literal
  ;; "[D]" followed by the file's title.  Read the doc string of
  ;; `denote-rename-buffer-format' for how to modify this.
  (denote-rename-buffer-mode 1)
  )

(use-package denote-org
  :ensure t
  )

(use-package consult-denote
  :ensure t
  :bind
  (("C-c n f" . consult-denote-find)
   ("C-c n g" . consult-denote-grep))
  :config
  (consult-denote-mode 1)
  )

(provide 'el-denote)
#+end_src

* markdown-mode
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/modes.el
(use-package markdown-mode
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  :bind (:map markdown-mode-map
              ("C-c C-e" . markdown-do)))
#+end_src
